# Loan Default Prediction

Financial inclusion has expanded access to banking services. The main function of banks is to lend money to borrowers using money saved by depositors. 

In deciding who to lend to, banks need to assess these borrowers based on traits and historical performance of their previous borrowings. This type of assessment is captured in the C's of credit.

In [65]:
import pandas as pd

data = pd.read_csv('Default_Fin.csv')

In [12]:
#Let's see what we have in the data
data.head(2)
data.describe()

             Index      Employed  Bank Balance  Annual Salary    Defaulted?
count  10000.00000  10000.000000  10000.000000   10000.000000  10000.000000
mean    5000.50000      0.705600  10024.498524  402203.782224      0.033300
std     2886.89568      0.455795   5804.579486  160039.674988      0.179428
min        1.00000      0.000000      0.000000    9263.640000      0.000000
25%     2500.75000      0.000000   5780.790000  256085.520000      0.000000
50%     5000.50000      1.000000   9883.620000  414631.740000      0.000000
75%     7500.25000      1.000000  13995.660000  525692.760000      0.000000
max    10000.00000      1.000000  31851.840000  882650.760000      1.000000

In [42]:

data.head(2)

   Employed  Bank Balance  Annual Salary  Defaulted?
0         1       8754.36      532339.56           0
1         0       9806.16      145273.56           0

In [41]:
#we don't need the index loaded with the csv
#data.drop('Index', axis=1,inplace=True)
#data.head(2)
#data.isna().sum()

In [47]:
data.columns

Index(['Employed', 'Bank Balance', 'Annual Salary', 'Defaulted?'], dtype='object')

In [68]:
data.rename(columns ={'Defaulted?' : 'Defaulted'}, inplace=True)

In [69]:
data

      Index  Employed  Bank Balance  Annual Salary  Defaulted
0         1         1       8754.36      532339.56          0
1         2         0       9806.16      145273.56          0
2         3         1      12882.60      381205.68          0
3         4         1       6351.00      428453.88          0
4         5         1       9427.92      461562.00          0
...     ...       ...           ...            ...        ...
9995   9996         1       8538.72      635908.56          0
9996   9997         1       9095.52      235928.64          0
9997   9998         1      10144.92      703633.92          0
9998   9999         1      18828.12      440029.32          0
9999  10000         0       2411.04      202355.40          0

[10000 rows x 5 columns]

## Selected Target

In [72]:
#TODO: select Defaulted? column as y

y= data.Defaulted

In [73]:
y.head(2)

0    0
1    0
Name: Defaulted, dtype: int64

In [ ]:
## Select Features

In [75]:
data.head(2)

   Index  Employed  Bank Balance  Annual Salary  Defaulted
0      1         1       8754.36      532339.56          0
1      2         0       9806.16      145273.56          0

In [86]:
feature_columns = ['Employed', 'Bank Balance', 'Annual Salary']

In [87]:
feature_columns

['Employed', 'Bank Balance', 'Annual Salary']

In [88]:
#TODO: use other columns as features except Defaulted? column
X = data[feature_columns]

In [80]:
X.head(2)

   Employed  Bank Balance  Annual Salary
0         1       8754.36      532339.56
1         0       9806.16      145273.56

## Create train and test datasets

In [89]:
from sklearn.model_selection import train_test_split

In [115]:
#TODO: create X_train, X_test, y_train, y_test
# use test_size of 30%

X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3)

In [116]:
X_train.shape

(7000, 3)

In [121]:
print('\n',X_train.head(2))
print('\n',X_test.head(2))
print('\n',y_train.head(2))
print('\n',y_test.head(2))

       Employed  Bank Balance  Annual Salary
2277         1      10465.80      486292.08
1753         1       5697.96      495465.96

       Employed  Bank Balance  Annual Salary
2419         0      14900.28      241260.84
6232         1       3215.52      553615.44

 2277    0
1753    0
Name: Defaulted, dtype: int64

 2419    0
6232    0
Name: Defaulted, dtype: int64

## Train Your Classification Model With A Decision Tree Classifier

In [101]:
from sklearn.tree import DecisionTreeClassifier

In [100]:
#TODO: create the model
DT_model = DecisionTreeClassifier(random_state=1)

In [122]:
#fit the model
DT_model.fit(X,y)

DecisionTreeClassifier(random_state=1)

In [106]:
#create your predictions
DT_preds = DT_model.predict(X)

## Score Your Decision Tree Model

In [107]:
from sklearn.metrics import accuracy_score

In [137]:
print(accuracy_score(DT_preds,y_test))

### What is the accuracy score of your decision tree model?

In [127]:
from sklearn.metrics import mean_absolute_error

MAE = mean_absolute_error(y,DT_preds)
print(MAE)

0.0

## Train Your Classification Model With A Random Forest Classifier

In [128]:
from sklearn.ensemble import RandomForestClassifier

In [129]:
#TODO: create the model
RF_model = RandomForestClassifier()

In [130]:
#fit the model
RF_model.fit(X_train, y_train)

RandomForestClassifier()

In [132]:
#create your predictions
RF_preds = RF_model.predict(X_test)

## Score Your Random Forest Model

In [133]:
from sklearn.metrics import accuracy_score

In [134]:
print(accuracy_score(RF_preds,y_test))

0.9693333333333334

### What is the accuracy score of your random forest model?

In [136]:
0.9693333333333334

0.9693333333333334

### What are some advantages of a Random Forest over a Decision Tree?

In [ ]:
#Random forest is more suitable for a large data set.
#Random forest combines multiple decision tree.

### Business understanding: what are some other features that can be added to this dataset to meet requirements of the 5 C's of credit

In [ ]:
# 1 internal terms and conditions for the business.
# 2 years of employment